nc: 6

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                    
  - [-1, 1, Conv, [64, 3, 2]]                    
  - [-1, 2, ConvNeXtBlockLite, []]             

  - [-1, 1, Conv, [128, 3, 2]]                
  - [-1, 2, ConvNeXtBlockLite, []]            

  - [-1, 1, Conv, [256, 3, 2]]                  
  - [-1, 4, ConvNeXtBlockLite, []]             

  - [-1, 1, Conv, [512, 3, 2]]                  
  - [-1, 2, ConvNeXtBlockLite, []]            

head:
  - [8, 1, Conv, [256, 1, 1]]                    
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   
  - [[-1, 6], 1, Concat, [1]]                
  - [-1, 2, C2f, [256]]                       

  - [-1, 1, Conv, [128, 1, 1]]                 
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   
  - [[-1, 4], 1, Concat, [1]]                  
  - [-1, 2, C2f, [128]]                       

  - [-1, 1, Conv, [128, 3, 2]]             
  - [[-1, 12], 1, Concat, [1]]          
  - [-1, 2, C2f, [256]]                   

  - [-1, 1, Conv, [256, 3, 2]]           
  - [[-1, 9], 1, Concat, [1]]             
  - [-1, 2, C2f, [256]]             

  - [[16, 19, 22], 1, Detect, [nc]]
