nc: 6

backbone:
  - [-1, 1, Conv, [32, 7, 2]]                    # 0
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]             # 1  (s4)

  - [-1, 1, Conv, [128, 1, 1]]                   # 2
  - [-1, 2, ResBlock, []]                        # 3  -> C2 (s4)

  - [-1, 1, Conv, [256, 3, 2]]                   # 4  (s8)
  - [-1, 2, ResBlock, []]                        # 5  -> C3

  - [-1, 1, Conv, [512, 3, 2]]                   # 6  (s16)
  - [-1, 3, ResBlock, []]                        # 7  -> C4

  - [-1, 1, Conv, [768, 3, 2]]                   # 8  (s32)
  - [-1, 2, ResBlock, []]                        # 9  -> C5

head:
  - [9, 1, Conv, [256, 1, 1]]                    # 10
  - [-1, 1, nn.Upsample, [None, 2, nearest]]     # 11
  - [[-1, 7], 1, Concat, [1]]                    # 12
  - [-1, 2, C2f, [256]]                          # 13

  - [-1, 1, Conv, [128, 1, 1]]                   # 14
  - [-1, 1, nn.Upsample, [None, 2, nearest]]     # 15
  - [[-1, 5], 1, Concat, [1]]                    # 16
  - [-1, 2, C2f, [128]]                          # 17

  - [-1, 1, Conv, [128, 3, 2]]                   # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19
  - [-1, 2, C2f, [256]]                          # 20

  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 10], 1, Concat, [1]]                   # 22
  - [-1, 2, C2f, [256]]                          # 23

  - [[17, 20, 23], 1, Detect, [nc]]
