nc: 6

backbone:
  - [-1, 1, MobileNetV3Stem, [16]]
  - [-1, 1, MobileNetV3Stage, [24, 2, 2]]
  - [-1, 1, MobileNetV3Stage, [40, 3, 2]]
  - [-1, 1, MobileNetV3Stage, [112, 3, 2]]
  - [-1, 1, MobileNetV3Stage, [160, 2, 2]]

head:
  - [4, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [[12, 15, 18], 1, Detect, [nc]]
