nc: 6

backbone:
  # Stem to s4 using ONLY k=3 (avoid even-kernel autopad size drift)
  - [-1, 1, Conv, [96, 3, 2]]                    # 0  (s2)
  - [-1, 1, Conv, [96, 3, 2]]                    # 1  (s4)
  - [-1, 3, ConvNeXtBlockLite, []]               # 2  -> C2 (s4)

  - [-1, 1, Conv, [192, 3, 2]]                   # 3  (s8)
  - [-1, 3, ConvNeXtBlockLite, []]               # 4  -> C3 (s8)

  - [-1, 1, Conv, [384, 3, 2]]                   # 5  (s16)
  - [-1, 9, ConvNeXtBlockLite, []]               # 6  -> C4 (s16)

  - [-1, 1, Conv, [768, 3, 2]]                   # 7  (s32)
  - [-1, 3, ConvNeXtBlockLite, []]               # 8  -> C5 (s32)

head:
  - [8, 1, Conv, [512, 1, 1]]                    # 9
  - [-1, 1, nn.Upsample, [None, 2, nearest]]     # 10
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 3, C2f, [512]]                          # 12

  - [-1, 1, Conv, [256, 1, 1]]                   # 13
  - [-1, 1, nn.Upsample, [None, 2, nearest]]     # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 3, C2f, [256]]                          # 16

  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 12], 1, Concat, [1]]                   # 18
  - [-1, 3, C2f, [512]]                          # 19

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 9], 1, Concat, [1]]                    # 21
  - [-1, 3, C2f, [512]]                          # 22

  - [[16, 19, 22], 1, Detect, [nc]]
