nc: 6

backbone:
  # Stem (stride 2)
  - [-1, 1, Conv, [64, 7, 2]]                  # 0
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]            # 1  (stride 4)

  # Stage C2 (s4)
  - [-1, 1, Conv, [256, 1, 1]]                  # 2
  - [-1, 3, ResBlock, []]                       # 3  -> C2

  # Stage C3 (s8)
  - [-1, 1, Conv, [512, 3, 2]]                  # 4
  - [-1, 4, ResBlock, []]                       # 5  -> C3

  # Stage C4 (s16)
  - [-1, 1, Conv, [1024, 3, 2]]                 # 6
  - [-1, 6, ResBlock, []]                       # 7  -> C4

  # Stage C5 (s32)
  - [-1, 1, Conv, [2048, 3, 2]]                 # 8
  - [-1, 3, ResBlock, []]                       # 9  -> C5

head:
  # P5 -> reduce + upsample -> fuse C4
  - [9, 1, Conv, [512, 1, 1]]                   # 10
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 11
  - [[-1, 7], 1, Concat, [1]]                   # 12
  - [-1, 3, C2f, [512]]                         # 13

  # -> upsample -> fuse C3
  - [-1, 1, Conv, [256, 1, 1]]                  # 14
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 15
  - [[-1, 5], 1, Concat, [1]]                   # 16
  - [-1, 3, C2f, [256]]                         # 17  (P3)

  # down -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 18
  - [[-1, 13], 1, Concat, [1]]                  # 19
  - [-1, 3, C2f, [512]]                         # 20  (P4)

  # down -> P5
  - [-1, 1, Conv, [512, 3, 2]]                  # 21
  - [[-1, 10], 1, Concat, [1]]                  # 22
  - [-1, 3, C2f, [512]]                         # 23  (P5)

  - [[17, 20, 23], 1, Detect, [nc]]
