nc: 6

backbone:
  - [-1, 1, ConvNeXtStem, [96]]
  - [-1, 1, ConvNeXtStage, [96, 3, 1]]
  - [-1, 1, ConvNeXtStage, [192, 3, 2]]
  - [-1, 1, ConvNeXtStage, [384, 9, 2]]
  - [-1, 1, ConvNeXtStage, [768, 3, 2]]

head:
  - [4, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [[12, 15, 18], 1, Detect, [nc]]
