nc: 6

backbone:
  - [-1, 1, Conv, [32, 7, 2]]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 2, ResBlock, [128]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, ResBlock, [256]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 3, ResBlock, [512]]

  - [-1, 1, Conv, [768, 3, 2]]
  - [-1, 2, ResBlock, [768]]

head:
  - [9, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]

  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C2f, [128]]

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]

  - [[17, 20, 23], 1, Detect, [nc]]
