nc: 6

backbone:
  - [-1, 1, Conv, [96, 3, 2]]                 
  - [-1, 1, Conv, [96, 3, 2]]             
  - [-1, 3, ConvNeXtBlockLite, []]           

  - [-1, 1, Conv, [192, 3, 2]]
  - [-1, 3, ConvNeXtBlockLite, []]             

  - [-1, 1, Conv, [384, 3, 2]]           
  - [-1, 9, ConvNeXtBlockLite, []]     

  - [-1, 1, Conv, [768, 3, 2]]            
  - [-1, 3, ConvNeXtBlockLite, []]      

head:
  - [8, 1, Conv, [512, 1, 1]]                    
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    
  - [[-1, 6], 1, Concat, [1]]               
  - [-1, 3, C2f, [512]]                       

  - [-1, 1, Conv, [256, 1, 1]]                 
  - [-1, 1, nn.Upsample, [None, 2, nearest]]   
  - [[-1, 4], 1, Concat, [1]]                    
  - [-1, 3, C2f, [256]]            

  - [-1, 1, Conv, [256, 3, 2]]         
  - [[-1, 12], 1, Concat, [1]]         
  - [-1, 3, C2f, [512]]                   

  - [-1, 1, Conv, [512, 3, 2]]              
  - [[-1, 9], 1, Concat, [1]]             
  - [-1, 3, C2f, [512]]            

  - [[16, 19, 22], 1, Detect, [nc]]
